leaf_cnn_7_a_0_vgg :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        1792
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 128)       73856
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 128)       0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 256)       295168
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 256)       590080
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 256)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 16384)             0
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              67112960
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0
_________________________________________________________________
dense_3 (Dense)              (None, 1000)              4097000
_________________________________________________________________
dense_4 (Dense)              (None, 10)                10010
=================================================================
Total params: 88,962,178
Trainable params: 88,962,178



leaf_cnn_7_a_1_nguyen64 :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        1792
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 64)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 128)       73856
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 32, 32, 128)       147584
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 128)       0
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 128)       0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 16, 16, 256)       295168
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 256)         0
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 256)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 16384)             0
_________________________________________________________________
dense_1 (Dense)              (None, 256)               4194560
_________________________________________________________________
dropout_4 (Dropout)          (None, 256)               0
_________________________________________________________________
dense_2 (Dense)              (None, 10)                2570
=================================================================
Total params: 4,789,386
Trainable params: 4,789,386



leaf_cnn_7_a_2_nguyen128 :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 128, 128, 128)     3584
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 128)     147584
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 128)     147584
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 64, 128)       0
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 64, 128)       0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 64, 256)       295168
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 64, 256)       590080
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 32, 256)       0
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 32, 256)       0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 32, 32, 512)       1180160
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 16, 16, 512)       0
_________________________________________________________________
dropout_3 (Dropout)          (None, 16, 16, 512)       0
_________________________________________________________________
flatten_1 (Flatten)          (None, 131072)            0
_________________________________________________________________
dense_1 (Dense)              (None, 512)               67109376
_________________________________________________________________
dropout_4 (Dropout)          (None, 512)               0
_________________________________________________________________
dense_2 (Dense)              (None, 10)                5130
=================================================================
Total params: 69,478,666
Trainable params: 69,478,666



leaf_cnn_7_b_0_5f :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 5)         140
_________________________________________________________________
flatten_1 (Flatten)          (None, 20480)             0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                204810
=================================================================
Total params: 204,950
Trainable params: 204,950



leaf_cnn_7_b_1_10f :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 10)        280
_________________________________________________________________
flatten_1 (Flatten)          (None, 40960)             0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                409610
=================================================================
Total params: 409,890
Trainable params: 409,890



leaf_cnn_7_b_2_64f :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        1792
_________________________________________________________________
flatten_1 (Flatten)          (None, 262144)            0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2621450
=================================================================
Total params: 2,623,242
Trainable params: 2,623,242



leaf_cnn_7_c_0_3x3 :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        1792
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
flatten_1 (Flatten)          (None, 262144)            0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2621450
=================================================================
Total params: 2,697,098
Trainable params: 2,697,098



leaf_cnn_7_c_1_5x5 :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        4864
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 64)        102464
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 64)        102464
_________________________________________________________________
flatten_1 (Flatten)          (None, 262144)            0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2621450
=================================================================
Total params: 2,831,242
Trainable params: 2,831,242



leaf_cnn_7_c_2_5x5DO :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        4864
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 64)        102464
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 64)        102464
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 64, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 262144)            0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2621450
=================================================================
Total params: 2,831,242
Trainable params: 2,831,242



leaf_cnn_7_c_3_3x3Dense :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        1792
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
flatten_1 (Flatten)          (None, 262144)            0
_________________________________________________________________
dense_1 (Dense)              (None, 30)                7864350
_________________________________________________________________
dense_2 (Dense)              (None, 10)                310
=================================================================
Total params: 7,940,308
Trainable params: 7,940,308



leaf_cnn_7_d_0_2block :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        1792
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 64)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 64)        36928
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 32, 32, 64)        36928
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 32, 32, 64)        36928
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 16384)             0
_________________________________________________________________
dense_1 (Dense)              (None, 30)                491550
_________________________________________________________________
dense_2 (Dense)              (None, 10)                310
=================================================================
Total params: 678,292
Trainable params: 678,292



leaf_cnn_7_d_1_2blockDO :
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        1792
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 64)        36928
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 64)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 64)        36928
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 32, 32, 64)        36928
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 32, 32, 64)        36928
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 64)        0
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 16384)             0
_________________________________________________________________
dense_1 (Dense)              (None, 30)                491550
_________________________________________________________________
dense_2 (Dense)              (None, 10)                310
=================================================================
Total params: 678,292
Trainable params: 678,292